{
    "scene0004": "Scene Type: Corridor/Small Room\nKey Objects:\n\n- Seating Units (Left Side, Aligned in a Row)\n- Table (Top-Center, Against the Wall)\n- Possible Entrance/Exit (Bottom-Center)\n- Wall Fixtures or Decorations (Right Side, Along the Wall)\n- Miscellaneous Items (Near the Table, Top-Left Corner)\n\nSpatial Arrangement Hint: The seating units are positioned linearly along the left wall, suggesting a waiting area or shared workspace.\n\nObject Interaction Clue: The table at the top-center is placed against the wall, likely serving as a reception or workspace, with surrounding items potentially indicating functional use.",
    "scene0005": "Scene Type: Office\n\nKey Objects:\n\n- Desk 1 (Center-right)\n- Desk 2 (Bottom-right)\n- Desk 3 (Top-right)\n- Chairs (Around desks, slightly misaligned)\n- Shelf or Cabinet (Left wall)\n\nSpatial Arrangement Hint:\nThe desks are arranged in a clustered layout, with chairs positioned irregularly around them, suggesting a shared workspace rather than individual stations.\n\nObject Interaction Clue:\nThe shelf or cabinet on the left wall appears to be placed close to an entrance or pathway, indicating it might store frequently used items or documents.ssibly indicating a conference or shared office environment.",
    "scene0006": "Scene Type: Hotel Room\n\nKey Objects:\n\n- Two Beds (Centrally placed, parallel to each other)\n- Nightstands (Between and beside beds)\n- Desk with Chair (Against the left wall, near the entrance)\n- TV or Monitor (On the desk, facing the beds)\n- Sofa or Seating Area (Near the bottom-left corner)\n\nSpatial Arrangement Hint: The two beds dominate the central space, with nightstands positioned for shared access, while the desk and seating area are aligned along the perimeter.\n\nObject Interaction Clue: The desk setup suggests a workspace or entertainment area, possibly facing the beds for TV viewing.",
    "scene0007": "Scene Type: Hallway with Stairs\n\nKey Objects:\n\n- Hallway Floor (Center, checkered pattern)\n- Stairs (Right side, leading upwards)\n- Shelves with Objects (Right side, next to stairs)\n- Wall-mounted Frame or Decoration (Left side, along hallway)\n- Open Passageway (Top-center, leading to another room)\n\nSpatial Arrangement Hint: The stairs are closely positioned next to the shelving, which may indicate a compact design requiring careful navigation.\n\nObject Interaction Clue: The open passageway at the end of the hallway suggests connectivity to a larger living area or another room.",
    "scene0008": "Scene Type: Office or Lounge Area\n\nKey Objects:\n\n- Chairs (Multiple, arranged in different sections)\n- Tables (Positioned near chairs, likely for seating arrangements)\n- Sofas (Right and top sections, adjacent to small tables)\n- Desk with Monitor or Device (Left side, near chairs)\n- Open Passageways (Center, leading to different sections)\n\nSpatial Arrangement Hint: The chairs and tables are arranged to support small-group discussions or individual seating, possibly for a lounge or waiting area.\n\nObject Interaction Clue: The sofas with small tables indicate a comfortable sitting area, likely intended for relaxation or informal meetings.",
    "scene0009": "Scene Type: Office or Lounge Area\n\nKey Objects:\n\n- Chairs (Multiple, arranged in different sections)\n- Tables (Positioned near chairs, likely for seating arrangements)\n- Sofas (Right and top sections, adjacent to small tables)\n- Desk with Monitor or Device (Left side, near chairs)\n- Open Passageways (Center, leading to different sections)\n\nSpatial Arrangement Hint: The chairs and tables are arranged to support small-group discussions or individual seating, possibly for a lounge or waiting area.\n\nObject Interaction Clue: The sofas with small tables indicate a comfortable sitting area, likely intended for relaxation or informal meetings.",
    "scene0010": "Scene Type: Office or Workspace\n\nKey Objects:\n\n- Desks with Computers (Left and right sides, occupied with multiple workstations)\n- Office Chairs (Scattered around desks, positioned for work)\n- Small Round Chairs (Center, arranged in a semi-circle, likely for discussions)\n- Shelving Units (Top-left, storing various items)\n- Doorway or Entrance (Bottom-center, leading into the room)\n\nSpatial Arrangement Hint: The central cluster of small chairs suggests a collaborative meeting space, distinct from the individual workstations along the desks.\n\nObject Interaction Clue: The long desks on both sides indicate a shared workspace setup, potentially for a team-based office environment.",
    "scene0011": "Scene Type: Conference Room\n\nKey Objects:\n\n- Large Conference Table (Center, surrounded by multiple chairs)\n- Chairs (Evenly spaced around the table)\n- Windows (Top section, allowing natural light to cast shadows)\n- Cabinet or Sideboard (Right side, likely for storage or refreshments)\n- Entrance or Doorway (Bottom-center, leading into the room)\n\nSpatial Arrangement Hint: The central table is the focal point, with chairs symmetrically arranged to facilitate meetings or discussions.\n\nObject Interaction Clue: The cabinet on the right may serve as a space for presentation materials, refreshments, or additional office supplies.",
    "scene0012": "Scene Type: Office or Study Room\n\nKey Objects:\n\n- Desk with Chair (Center, positioned against the back wall)\n- Armchairs (Left and right sides, arranged for seating)\n- Wall-mounted Artwork or Rug (Back wall, above the desk)\n- Table Lamp (Near the center, providing localized lighting)\n- Side Table or Bookshelf (Bottom-right, used for storage or display)\n\nSpatial Arrangement Hint: The desk against the back wall establishes a focal point for work or study, while the armchairs create a conversational or waiting area.\n\nObject Interaction Clue: The table lamp and seating arrangement suggest a setting designed for reading, discussion, or consultation.",
    "scene0013": "Scene Type: Lounge or Sitting Area\n\nKey Objects:\n\n- Four Armchairs (Arranged in a circular or semi-circular layout)\n- Central Table or Rug (Middle, possibly for decoration or functionality)\n- Fireplace or Decorative Niche (Top-center, suggesting a focal point)\n- Side Tables or Small Furnishings (Scattered, potentially for holding items)\n- Open Pathways (Around the seating area, allowing movement)\n\nSpatial Arrangement Hint: The four armchairs surrounding the central table or rug suggest a conversational seating layout, promoting interaction.\n\nObject Interaction Clue: The fireplace or decorative niche at the top may serve as a visual anchor, influencing how the seating arrangement is oriented.",
    "scene0014": "Scene Type: Bathroom\n\nKey Objects:\n\n- Double Sink Vanity (Top-center, with mirrors and storage above)\n- Toilet (Top-right, placed in a semi-enclosed area)\n- Shower or Bathtub (Bottom-center, with a curtain or glass partition)\n- Storage Shelving or Cabinet (Above sinks, storing toiletries)\n- Bath Mat (Center, positioned for drying after shower use)\n\nSpatial Arrangement Hint: The toilet is placed in a slightly separated corner, offering some privacy within the shared bathroom space.\n\nObject Interaction Clue: The double sink vanity suggests that this bathroom is designed for shared use, likely in a household or a hotel setting.",
    "scene0015": "Scene Type: Classroom or Study Area\n\nKey Objects:\n\n- Multiple Long Tables (Arranged in parallel rows)\n- Chairs (Positioned around tables, facing inward)\n- Open Walkway (Center, allowing movement between tables)\n- Shelving or Storage Units (Top section, possibly for books or supplies)\n- Entrance or Exit (Bottom-left, leading into the room)\n\nSpatial Arrangement Hint: The parallel table layout with chairs on both sides suggests a collaborative workspace, likely for study or group discussions.\n\nObject Interaction Clue: The open central walkway ensures accessibility, allowing easy navigation between seating areas.",
    "scene0016": "Scene Type: Living Room or Lounge Area\n\nKey Objects:\n\n- Sofa with Cushions (Bottom section, facing inward)\n- Entertainment Center or TV Setup (Right side, with possible seating arrangement)\n- Desk with Chair (Top-right, likely a workspace or gaming setup)\n- Wall-mounted Mirror or Artwork (Left side, adding depth to the space)\n- Open Walkway (Center, connecting different functional areas)\n\nSpatial Arrangement Hint: The sofa faces the entertainment center, suggesting this is a primary lounging or media-watching area.\n\nObject Interaction Clue: The workspace setup in the top-right corner indicates a multifunctional space, balancing relaxation and productivity.",
    "scene0017": "Scene Type: Office or Meeting Room\n\nKey Objects:\n\n- Large Desk/Table (Center, cluttered with various items)\n- Office Chairs (Surrounding the table, positioned for discussion)\n- Wall-mounted Items (Poster or Whiteboard) (Left side, likely for reference or presentation)\n- Stacked Storage Bins (Top-right corner, used for organization)\n- Entryway or Door (Bottom section, leading into the room)\n\nSpatial Arrangement Hint: The central desk with chairs around it suggests a workspace or meeting area, facilitating discussions or collaborative work.\n\nObject Interaction Clue: The cluttered desk indicates active use, possibly for ongoing projects, paperwork, or technical work requiring tools and supplies.",
    "scene0018": "Scene Type: Office or Study Room\n\nKey Objects:\n\n- Work Desk with Computer Setup (Right side, primary workspace)\n- Bookshelves or Storage Racks (Right wall, filled with items)\n- Large Table with Objects (Left side, possibly for additional workspace or meetings)\n- Cabinet or Additional Storage (Top-left corner, likely for organization)\n- Open Walkway (Center, allowing movement between workstations)\n\nSpatial Arrangement Hint: The desk with a computer setup on the right suggests a dedicated workspace, while the left-side table may serve as a collaborative or overflow area.\n\nObject Interaction Clue: The bookshelves along the right wall indicate an emphasis on reference materials, making the space well-suited for research, study, or creative work.",
    "scene0019": "Scene Type: Storage or Utility Room\n\nKey Objects:\n\n- Shelving Units (Right side, filled with various items)\n- Wall-mounted Rack or Hooks (Bottom section, possibly for hanging items)\n- Open Wall Space (Center, suggesting an unfinished or decorative wall)\n- Cabinet or Countertop (Left side, potentially for work or storage)\n- Circular Opening or Pipe Fixture (Left wall, possibly for ventilation or utilities)\n\nSpatial Arrangement Hint: The shelving units on the right indicate that this space is used for organization and storage, possibly for tools, supplies, or archived materials.\n\nObject Interaction Clue: The circular opening on the left suggests an area where ventilation, plumbing, or utility connections might be present, indicating a functional rather than a living space.",
    "scene0020": "Scene Type: Storage or Utility Room\n\nKey Objects:\n\n- Shelving Units (Left and right sides, filled with various items)\n- Overhead Storage Area (Top-center, possibly for infrequently used items)\n- Work Bench or Countertop (Center, used for repairs or sorting items)\n- Hanging Objects or Tools (Middle section, possibly for easy access)\n- Window or Light Source (Top, providing illumination)\n\nSpatial Arrangement Hint: The overhead storage and shelving on both sides maximize space usage, indicating a compact storage solution.\n\nObject Interaction Clue: The hanging objects in the center suggest a workspace where tools or equipment are frequently accessed and used.",
    "scene0021": "Scene Type: Living Room or Lounge Area\n\nKey Objects:\n\n- Curved Sofa (Left side, large seating area)\n- Two Armchairs (Right side, positioned for conversation)\n- Small Side Tables (Near the armchairs, for convenience)\n- Two Distinct Carpeted Areas (One under seating, one patterned section)\n- Walkway/Open Space (Center, allowing movement between seating)\n\nSpatial Arrangement Hint: The curved sofa and armchairs create a semi-circular conversational area, promoting interaction and comfort.\n\nObject Interaction Clue: The side tables next to the armchairs suggest they are intended for reading, drinks, or decorative items, enhancing usability.",
    "scene0022": "Scene Type: Meeting or Break Room\n\nKey Objects:\n\n- Rectangular Table with Chairs (Center-left, main work or meeting area)\n- Two Round Tables with Chairs (Top-left and bottom-right, additional seating)\n- Counter or Storage Area (Right side, possibly for supplies or refreshments)\n- Shelving or Cabinets (Top-right, for organization)\n- Walkway/Open Space (Center, allowing movement between tables and storage areas)\n\nSpatial Arrangement Hint: The combination of rectangular and round tables suggests a flexible space for both structured meetings and informal discussions.\n\nObject Interaction Clue: The counter and shelving on the right indicate this space may also serve as a break area, supporting food or beverage storage.",
    "scene0023": "Scene Type: Conference or Meeting Room\n\nKey Objects:\n\n- Two Rectangular Tables with Chairs (Center, arranged for meetings or collaboration)\n- Long Counter with Seating (Top-left, possibly for presentations or workspace)\n- Perimeter Seating (L-Shaped Arrangement) (Top-right and right side, allowing for group discussions)\n- Windows with Natural Light (Bottom-right, illuminating the room)\n- Walkway/Open Space (Center, enabling easy movement between seating areas)\n\nSpatial Arrangement Hint: The L-shaped seating along the perimeter suggests a space designed for discussions, training sessions, or team meetings with a focus point.\n\nObject Interaction Clue: The counter with additional seating on the left could function as a break area or secondary workspace, complementing the meeting setup.",
    "scene0024": "Scene Type: Living Room\n\nKey Objects:\n\n- Sofa and Armchairs (Left and top sections, creating a comfortable seating area)\n- Coffee Table (Center, likely used for decoration or utility)\n- Bookshelves and Side Tables (Scattered along the edges, holding decor and personal items)\n- Entertainment Unit or TV Stand (Bottom, facing the main seating area)\n- Windows with Natural Light (Top-left, enhancing the brightness of the space)\n\nSpatial Arrangement Hint: The seating arrangement forms a semi-circle around the coffee table, suggesting a conversational or entertainment-focused space.\n\nObject Interaction Clue: The entertainment unit at the bottom indicates this room is used for media consumption, possibly making it a primary gathering spot in the home.",
    "scene0025": "Scene Type: Office or Work Lounge\n\nKey Objects:\n\n- Curved Work Desk with Computers (Bottom-center, main workspace)\n- Office Chairs (Around the desk, positioned for work)\n- Two Sofas (Top-left and top-right, for relaxation or informal meetings)\n- Side Tables (Next to sofas, providing convenience for users)\n- Bookshelf or Storage Unit (Top-left, likely for organization)\n\nSpatial Arrangement Hint: The work desk is positioned centrally with sofas on both sides, indicating a balance between productivity and relaxation.\n\nObject Interaction Clue: The dual-use space with both workstations and lounge seating suggests a collaborative environment where people can switch between focused work and informal discussions.",
    "scene0026": "Scene Type: Bathroom\n\nKey Objects:\n\n- Double Sink Vanity (Top-right, main grooming area)\n- Toilets (Left and bottom-left, indicating a multi-stall or dual-use setup)\n- Mirrors and Storage Shelves (Above the sinks, for convenience)\n- Shower or Bathtub Area (Right side, partially enclosed)\n- Entryway or Hallway (Bottom-center, leading into the space)\n\nSpatial Arrangement Hint: The double vanity and multiple toilets suggest a shared or communal bathroom, possibly in a home or office setting.\n\nObject Interaction Clue: The mirrors and storage above the sinks provide accessibility for toiletries, making the space efficient for multiple users at the same time.",
    "scene0027": "Scene Type: Café or Small Dining Area\n\nKey Objects:\n\n- Booth Seating with Table (Right side, arranged in an \"L\" shape)\n- Two Small Square Tables with Chairs (Left side, providing additional seating)\n- Wall-mounted Shelves or Decor (Left wall, possibly for storage or ambiance)\n- Open Walkway (Center, allowing movement between seating areas)\n- Counter or Service Area (Top-right, suggesting a food-serving space)\n\nSpatial Arrangement Hint: The booth seating on the right maximizes space efficiency while creating a cozy dining or seating area.\n\nObject Interaction Clue: The counter space on the top-right suggests this could be a café, diner, or casual restaurant with counter service.",
    "scene0028": "Scene Type: Lounge or Waiting Area\n\nKey Objects:\n\n- Round Table with Chairs (Bottom-center, main communal seating)\n- Three Small Round Tables with Stools (Top-center, casual seating area)\n- Couches and Armchairs (Left and right sides, providing comfortable seating)\n- Cabinets or Shelving Units (Top-left and top-right, possibly for storage or decor)\n- Open Walkways (Center and sides, allowing movement between seating areas)\n\nSpatial Arrangement Hint: The mix of formal and informal seating options suggests a multi-purpose lounge, likely used for casual meetings, socializing, or waiting.\n\nObject Interaction Clue: The round tables and seating clusters encourage group interactions, making this space suitable for discussions or small gatherings.",
    "scene0029": "Scene Type: Bathroom\n\nKey Objects:\n\n- Bathtub (Top-left, standard bathing area)\n- Toilet (Bottom-center, next to the shelving unit)\n- Sink with Storage Shelves (Bottom-right, used for toiletries)\n- Wall-mounted Towel Rack (Left wall, near the sink)\n- Bath Mat or Rug (Center, placed for drying and comfort)\n\nSpatial Arrangement Hint: The bathtub is positioned along the back wall, maximizing space in this compact bathroom layout.\n\nObject Interaction Clue: The shelves next to the toilet provide accessible storage for toiletries, making efficient use of the limited space.",
    "scene0030": "Scene Type: Classroom or Study Room\n\nKey Objects:\n\n- Two Long Tables (Center, arranged for workspace or collaboration)\n- Multiple Office Chairs (Positioned around tables for seating)\n- Bookshelves (Left side, filled with books and materials)\n- Chalkboards or Whiteboards (Right and top walls, likely for instruction)\n- Counter with Stools (Bottom side, possibly for additional workspace or storage)\n\n\nSpatial Arrangement Hint: The two long tables with chairs suggest a collaborative working or learning environment, while the bookshelves and chalkboards indicate an educational or study-focused space.\n\nObject Interaction Clue: The counter with stools provides an alternative workspace, likely for individual study, small group discussions, or instructional demonstrations.",
    "scene0031": "Scene Type: Lounge or Meeting Area\n\nKey Objects:\n\n- Central Table (Middle, serving as a workspace or meeting point)\n- Multiple Sofas (Arranged along the walls, providing seating)\n- Bookshelves or Storage Units (Top-left and top-right, likely for organization)\n- Side Tables (Near sofas, for convenience)\n- Open Walkway (Center, allowing movement between seating and storage areas)\n\nSpatial Arrangement Hint: The sofas lining the walls create an open central space, likely intended for collaborative discussions, relaxation, or informal meetings.\n\nObject Interaction Clue: The central table and side tables provide accessible surfaces for documents, refreshments, or personal items, supporting a functional and comfortable gathering space.",
    "scene0032": "Scene Type: Bedroom\n\nKey Objects:\n\n- Bed with Blue Cover (Right side, main sleeping area)\n- Desk with Chair (Top-left, workspace or study area)\n- Shelving Unit (Above desk, for storage and organization)\n- Window (Left side, providing natural light)\n- Open Walkway (Center, allowing movement between furniture)\n\nSpatial Arrangement Hint: The bed is positioned against the right wall, maximizing floor space and leaving room for a functional workspace on the opposite side.\n\nObject Interaction Clue: The desk under the shelving unit suggests an efficient study or work setup, with easy access to books, supplies, or decorations.",
    "scene0033": "Scene Type: Lounge or Café Area\n\nKey Objects:\n\n- Round Tables (Scattered throughout, providing small-group seating)\n- Armchairs (Placed around tables, arranged for conversation)\n- Sofas or Lounge Chairs (Distributed along the edges, offering relaxed seating)\n- Potted Plant (Near center, adding decorative greenery)\n- Open Walkway (Runs through the space, facilitating easy movement)\n\nSpatial Arrangement Hint: The scattered round tables with individual seating areas suggest a casual, social space designed for relaxation, meetings, or dining.\n\nObject Interaction Clue: The mix of armchairs and lounge seating provides both formal and informal seating options, making the space versatile for different activities.",
    "scene0034": "Scene Type: Bathroom and Laundry Area\n\nKey Objects:\n\n- Toilet (Left section, partially enclosed for privacy)\n- Double Sink Vanity (Top-right, main grooming area)\n- Washing Machine or Dryer (Right side, integrated into the counter space)\n- Shelving or Storage Units (Above sinks, holding toiletries and essentials)\n- Open Walkway (Center, allowing access to different functional areas)\n\nSpatial Arrangement Hint: The combination of bathroom and laundry functions suggests a multi-use space designed for efficiency, with key utilities positioned along the walls.\n\nObject Interaction Clue: The washing machine built into the counter allows for seamless integration of laundry tasks within a bathroom environment, optimizing available space.",
    "scene0035": "Scene Type: Bedroom\n\nKey Objects:\n\n- Bed with Dark Cover (Top-center, primary sleeping area)\n- Desk with Chair (Bottom-center, workspace or study area)\n- Storage Cabinets (Right side, likely used for clothes or personal items)\n- Shelves or Small Cabinet (Left side, additional storage or decor placement)\n- Window (Left wall, providing natural light)\n\nSpatial Arrangement Hint: The bed is positioned against the top wall, maximizing floor space and leaving room for a functional study area at the bottom.\n\nObject Interaction Clue: The desk near storage cabinets suggests a practical arrangement, allowing for efficient use of space between work and personal storage needs.",
    "scene0036": "Scene Type: Lounge or Living Room\n\nKey Objects:\n\n- Sofa with Green Cushions (Top-center, primary seating area)\n- Two Armchairs with Side Tables (Bottom-right, additional seating)\n- Round Coffee Table (Center, serving as a shared surface)\n- Desk with Chair (Right side, secondary workspace or storage area)\n- Small Cabinet or Bookshelf (Left side, for storage or decoration)\n\nSpatial Arrangement Hint: The sofa and armchairs form a conversational layout around the coffee table, creating a cozy and functional seating arrangement.\n\nObject Interaction Clue: The desk on the right suggests a multi-use space, allowing for both relaxation and light workspace activities",
    "scene0037": "Scene Type: Conference or Meeting Room\n\nKey Objects:\n\n- Large Circular Table (Center, primary meeting space)\n- Multiple Office Chairs (Arranged around the table for seating)\n- Bookshelves or Storage Units (Left and right sides, holding materials)\n- Open Walkways (Surrounding the table, allowing easy movement)\n- Recessed Ceiling or Skylight (Above the table, adding illumination)\n\nSpatial Arrangement Hint: The circular table with evenly spaced chairs suggests a collaborative meeting environment, promoting equal participation.\n\nObject Interaction Clue: The bookshelves along the sides indicate storage for reference materials, making this space ideal for discussions, presentations, or study sessions.",
    "scene0038": "Scene Type: Restaurant or Café\n\nKey Objects:\n\n- Dining Tables with Chairs (Bottom-center, arranged for group seating)\n- Bar or Counter Area (Top-right, with a red canopy)\n- Additional Seating Along the Wall (Left side, offering alternative seating options)\n- Red Carpet or Divider (Middle, separating different sections)\n- Wall-mounted Equipment or Fixtures (Top-right, possibly a menu or service area)\n\nSpatial Arrangement Hint: The central dining tables and bar area suggest a restaurant or café setup, with a separation between dining and service areas.\n\nObject Interaction Clue: The bar counter with canopy likely serves as the main service point, where customers order food and drinks before seating themselves.",
    "scene0039": "Scene Type: Bedroom\n\nKey Objects:\n\n- Bed with Dark Cover (Bottom-center, main sleeping area)\n- Shelving Unit or Closet (Left wall, for storage or decoration)\n- Desk with Chair (Top-right, workspace setup)\n- Additional Seating or Small Furniture (Top-left, near the wall)\n- Open Walkway (Center, allowing movement between the furniture)\n\nSpatial Arrangement Hint: The bed is positioned against the lower wall, maximizing space for a functional workspace and storage along the other walls.\n\nObject Interaction Clue: The desk and shelving unit indicate a multi-use space, allowing for both studying or working while maintaining storage efficiency.",
    "scene0040": "Scene Type: Shared Workspace or Studio\n\nKey Objects:\n\n- Multiple Desks with Chairs (Lining the walls, used for work or study)\n- Orange Couch (Center, providing a casual seating area)\n- Bookshelves and Storage Units (Right and left walls, holding materials and supplies)\n- Personalized Wall Decorations (Left side, indicating a creative or personal workspace)\n- Open Walkway (Middle, allowing easy movement between desks and seating)\n\nSpatial Arrangement Hint: The desks are positioned along the walls, maximizing workspace while leaving an open center area for discussion or relaxation.\n\nObject Interaction Clue: The central couch suggests a break area, making the space conducive to both individual work and collaborative interactions.",
    "scene0041": "Scene Type: Classroom or Meeting Room\n\nKey Objects:\n\n- Multiple Rectangular Tables (Evenly spaced, used for group seating or discussions)\n- Office Chairs (Arranged around the tables for seating)\n- Chalkboard or Whiteboard (Top wall, likely for instruction or presentations)\n- Dark Flooring (Providing contrast with light-colored tables)\n- Open Walkways (Between tables, allowing for movement and accessibility)\n\nSpatial Arrangement Hint: The uniformly arranged tables and chairs suggest a structured environment, suitable for learning, meetings, or collaborative work.\n\nObject Interaction Clue: The chalkboard or whiteboard at the front indicates that the room is likely used for teaching, presentations, or discussions.",
    "scene0042": "Scene Type: Public Restroom\n\nKey Objects:\n\n- Toilets with Partitions (Top-left and top-right, providing privacy)\n- Sinks with Mirrors (Top-right, used for handwashing)\n- Paper Towel or Soap Dispenser (Mounted near sinks, for hygiene)\n- Tiled Flooring (Common for water-resistant surfaces)\n- Open Walkways (Center, allowing access to stalls and sinks)\n\nSpatial Arrangement Hint: The toilets are separated by partitions, ensuring privacy, while the sinks are positioned near the entrance for easy access after use.\n\nObject Interaction Clue: The sink area with mirrors and dispensers indicates a standard hygiene setup, commonly found in public restrooms.",
    "scene0043": "Scene Type: Small Office or Study Room\n\nKey Objects:\n\n- Work Desk with Chair (Left side, primary workspace)\n- Additional Chair (Near the desk, possibly for meetings or guests)\n- Couch or Bench (Right side, providing an informal seating area)\n- Cabinet or Storage Unit (Near the couch, likely for books or supplies)\n- Open Walkway (Center, allowing movement between work and seating areas)\n\nSpatial Arrangement Hint: The desk and chair setup on the left suggests a workspace, while the couch on the right provides a more relaxed seating option, making the room versatile.\n\nObject Interaction Clue: The combination of desk and seating area indicates that the space can serve both as a focused work environment and a casual meeting area.",
    "scene0044": "Scene Type: Stairwell or Multi-Level Passageway\n\nKey Objects:\n\n- Two Staircases (Left and Right) (Leading between different floors)\n- Handrails (Supporting safe movement along the stairs)\n- Walls and Structural Supports (Defining the enclosed stairwell space)\n- Lower-level Landing Area (Bottom-center, serving as a transition point)\n- Openings or Doorways (Possible access points leading to other rooms)\n\nSpatial Arrangement Hint: The two staircases on opposite sides indicate a multi-floor structure, likely designed for smooth vertical movement between levels.\n\nObject Interaction Clue: The presence of handrails and enclosed walls suggests a controlled environment, ensuring safety and accessibility while moving between floors.",
    "scene0045": "Scene Type: Lounge or Waiting Area\n\nKey Objects:\n\n- L-shaped Leather Couch (Left-side, primary seating area)\n- Two Round Tables (Near couch, serving as coffee or side tables)\n- Two Square Ottomans (Near tables, providing additional seating or footrests)\n- Cabinet or Shelf (Right-side, possibly for storage or decoration)\n- Open Floor Space (Center, allowing movement within the room)\n\nSpatial Arrangement Hint: The L-shaped couch and small tables suggest a cozy, social setting, likely designed for relaxed conversations or informal meetings.\n\nObject Interaction Clue: The tables and ottomans are positioned close to the couch, encouraging shared usage for resting items, working, or casual interaction.",
    "scene0046": "Scene Type: Hotel Room or Small Dormitory\n\nKey Objects:\n\n- Single Bed (Right-side, primary sleeping area)\n- Work Desk with Chair (Left-side, workspace or study area)\n- Small Closet or Storage Shelf (Top-right, for personal belongings)\n- Bathroom with Sink and Toilet (Bottom, separate hygiene area)\n- Curtained Window (Top, allowing natural light and ventilation)\n\nSpatial Arrangement Hint: The compact layout with a designated sleeping, working, and bathroom area suggests an efficient space for short-term stays, such as a hotel or dormitory room.\n\nObject Interaction Clue: The desk is positioned near the bed, allowing easy transitions between work and rest, while the bathroom is conveniently located near the entrance.",
    "scene0047": "Scene Type: Dining Area or Break Room\n\nKey Objects:\n\n- Oval or Round Table (Center, primary gathering area for meals or meetings)\n- Chairs Surrounding the Table (Evenly spaced for seating)\n- Kitchen Counter with Cabinets (Right-side, likely for food storage and preparation)\n- Shelving or Storage Units (Top-right, used for organization and supplies)\n- Small Appliance or Microwave (Bottom-right, enhancing utility for food preparation)\n\nSpatial Arrangement Hint: The table is centrally positioned, making it the focal point for group activities, while kitchen utilities and storage are placed along the periphery for accessibility.\n\nObject Interaction Clue: The presence of seating around the table encourages communal use, and the kitchen area suggests frequent food-related activities, such as dining or coffee breaks.",
    "scene0048": "Scene Type: Casual Dining or Café Area\n\nKey Objects:\n\n- Two Round Tables (Right-center, primary seating areas for dining or socializing)\n- Chairs Around Tables (Arranged for seating, indicating shared use of space)\n- Counter or Bar Area (Left-side, possibly for ordering food or drinks)\n- Stools or High Chairs (Near the counter, likely for quick dining or waiting area)\n- Decorative or Functional Items (Scattered, adding to the ambiance of a relaxed setting)\n\nSpatial Arrangement Hint: Tables are placed centrally with chairs surrounding them, allowing easy access, while the counter/bar area suggests a service point or food preparation zone.\n\nObject Interaction Clue: The round tables and seating layout encourage social interactions, making this an ideal café or communal dining area where people gather for meals or casual conversations.\n\n\n\n\n\n\n\n\n\n\n\n\nSuche",
    "scene0049": "Scene Type: Living Room or Lounge Area\n\nKey Objects:\n\n- Red Sofa (Left side, main seating area, providing comfort and relaxation)\n- Red Armchair (Bottom-right, additional seating for guests or reading nook)\n- Coffee Table (Center, placed on a rug, likely used for décor, books, or drinks)\n- Bookshelves or Storage Units (Right side, possibly holding books, decorations, or entertainment items)\n- Large Rug (Middle, anchoring the seating area, adding warmth and cohesion to the space)\n\nSpatial Arrangement Hint: The sofa and armchair form a conversational seating layout, with the coffee table acting as the central hub, making it a cozy and inviting space for relaxation or social interactions.\n\nObject Interaction Clue: The soft furnishings, coffee table, and shelves suggest a space designed for comfort, reading, and entertainment, making this a typical living room or lounge area where people unwind or host guests.",
    "scene0050": "Scene Type: Living Room or Lounge Area\n\nKey Objects:\n\n- Large Brown Sofa (Left side, primary seating for relaxation and socialization)\n- Armchair (Right side, providing additional seating comfort)\n- Coffee Table (Center, positioned on a rug, likely used for drinks, books, or décor items)\n- Bookshelves or Media Unit (Bottom-left, potentially holding books, decorative items, or entertainment devices)\n- Work Desk or Storage Area (Top-right, suggesting a multi-purpose space blending work and leisure activities)\n\nSpatial Arrangement Hint: The furniture is arranged around the coffee table and rug, creating a comfortable and inviting seating area, with the work desk area suggesting a functional workspace within the living environment.\n\nObject Interaction Clue: The combination of seating, a coffee table, and bookshelves indicates a space designed for relaxation, reading, and casual gatherings, making it a versatile living area suitable for both entertainment and productivity.",
    "scene0051": "Scene Type: Studio Apartment or Small Living Space\n\nKey Objects:\n\n- Bed with Pink Bedding (Top-right, primary sleeping area, likely serving as a focal point in the room)\n- Bathroom Fixtures (Top-left, featuring a toilet, sink, and mirror, indicating a compact bathroom space)\n- Small Table or Desk (Middle, next to the bed, possibly used for study, work, or personal items)\n- Couch or Seating Area (Bottom-center, providing additional relaxation space or guest seating)\n- Bookshelf or Storage Unit (Bottom-right, holding books, decorative items, or essentials for organization)\n\nSpatial Arrangement Hint: The space is compact and efficiently arranged, integrating sleeping, living, and working areas. The bathroom is positioned separately, maximizing functionality while maintaining accessibility.\n\nObject Interaction Clue: The placement of the bed, desk, and seating suggests a multifunctional living environment where relaxation, work, and social activities can coexist, making this an ideal setting for a single occupant or a student lifestyle.",
    "scene0052": "Scene Type: Utility Room or Storage Space\n\nKey Objects:\n\n- Metal Ladder (Top-center, leading to an upper area, possibly an attic or loft storage)\n- Electrical Panel or Utility Box (Right side, mounted on the wall, suggesting maintenance or service access)\n- Small Counter with Circular Openings (Bottom-right, possibly for laundry or mechanical utilities)\n- Wooden Shelves or Storage Units (Left side, for keeping tools, equipment, or household items)\n- Open Central Space (Middle, providing room for movement, maintenance work, or additional storage placement)\n\nSpatial Arrangement Hint: This appears to be a practical, functional space designed for maintenance, storage, or mechanical equipment access. The ladder and utility panel indicate a space that may be infrequently used but essential for household operations.\n\nObject Interaction Clue: The presence of the ladder and electrical panel suggests the room is used for occasional maintenance, storage retrieval, or access to hidden utilities. The counter with circular cutouts may indicate a laundry setup or a small workspace for repairs.",
    "scene0053": "Scene Type: Lounge or Waiting Area\n\nKey Objects:\n\n- Large Sofa (Left side, main seating area for relaxation or waiting)\n- Smaller Sofa or Bench (Top-center, additional seating option, possibly for guests or visitors)\n- Rectangular Coffee Table (Center, a focal point for placing items like magazines, drinks, or decorations)\n- Curved Decorative Element (Top-left, could be an artistic feature, a railing, or furniture accent)\n- Open Floor Space (Middle, providing room for movement and flexibility in seating arrangement)\n\nSpatial Arrangement Hint: This space is designed for comfort and social interaction, with sofas positioned for conversation and a coffee table centralizing the seating area.\n\nObject Interaction Clue: The coffee table suggests a place for informal gatherings, while the sofas indicate a setting for relaxation or waiting. The curved element may define a transition area or serve as a decorative touch.",
    "scene0054": "Scene Type: Multi-Functional Office Space\n\nKey Objects:\n\n- Workstations with Chairs (Top section, arranged in a semi-circular manner, suggesting a collaborative workspace)\n- Couch and Coffee Table (Bottom-right, providing a casual meeting or relaxation area)\n- Desk with Computer (Bottom-left, individual workspace or reception area)\n- Bathroom Area (Middle-right, including sinks and toilets for employee convenience)\n- Connecting Hallway (Center, linking the office workspace with the lounge and bathroom area)\n\nSpatial Arrangement Hint: This scene combines workspaces, a relaxation zone, and functional areas, likely indicating a small office or studio setting. The hallway serves as a transition point between zones, maintaining workflow efficiency.\n\nObject Interaction Clue: The workstations suggest a structured work environment, while the couch and coffee table imply casual meetings or breaks. The hallway ensures easy access to all sections, improving functionality.",
    "scene0055": "Scene Type: Small Bedroom or Dormitory\n\nKey Objects:\n\n- Bed with Blue Bedding (Bottom-right, primary sleeping area)\n- Desk with Chair (Top-right, workspace or study area)\n- Shelving Unit (Above the desk, used for storage or decoration)\n- Window (Top-center, providing natural light and ventilation)\n- Narrow Walkway (Center-left, connecting the entrance to the main functional areas)\n\nSpatial Arrangement Hint: The layout suggests a compact, single-person living space, possibly a dormitory or small apartment bedroom. The bed and desk are positioned efficiently to maximize available space, and the shelves offer additional storage.\n\nObject Interaction Clue: The desk and shelving indicate a functional workspace, while the bed's positioning suggests a private resting area. The narrow walkway ensures accessibility without crowding the room.",
    "scene0056": "Scene Type: Office or Classroom with Workstations\n\nKey Objects:\n\n- Rows of Desks (Centrally aligned, used for work or study purposes)\n- Office Chairs (Positioned at each desk, indicating individual workstations)\n- Computers or Laptops (Scattered across the desks, suggesting a tech-based environment)\n- Ceiling Lights (Providing overhead illumination for the workspace)\n- Entrance Door (Right side, serving as the main access point to the room)\n\nSpatial Arrangement Hint: The desks are arranged in parallel rows, optimizing space for multiple users while allowing for easy movement between workstations. The entrance is positioned conveniently for access without disrupting workflow.\n\nObject Interaction Clue: The presence of computers and organized workstations suggests an environment dedicated to focused tasks, such as an office workspace, computer lab, or classroom setting.",
    "scene0057": "Scene Type: Storage or Workshop Area\n\nKey Objects:\n\n- Shelving Units (Lining both sides, filled with various items, likely for storage or inventory purposes)\n- Work Tables (Scattered within the space, potentially used for assembling or sorting items)\n- Industrial or Utility Lighting (Providing dim overhead illumination, typical for storage areas or workshops)\n- Assorted Boxes and Containers (Positioned throughout, indicating an active workspace or warehouse setting)\n- Open Walkway (Center of the room, allowing access to different sections of the space)\n\nSpatial Arrangement Hint: The narrow aisle between storage shelves suggests an organized inventory system, common in warehouses, workshops, or supply rooms. Items are stored along the periphery for easy retrieval while maintaining a central access route.\n\nObject Interaction Clue: The presence of work tables and scattered equipment suggests that this area is not only for storage but also for processing, packaging, or light assembly work. The functional setup indicates an efficient space for handling various materials.",
    "scene0058": "Scene Type: Office or Workstation Area\n\nKey Objects:\n\n- Work Desks (Centered, occupied with various items like computers, documents, and office supplies)\n- Office Chairs (Surrounding the desks, indicating a shared or collaborative workspace)\n- Lounge Chairs (Positioned along the right wall, likely for informal meetings or waiting)\n- Storage Cabinets or Shelves (Against the walls, used for keeping office supplies or personal belongings)\n- Partitioned Sections (Dividing the room, possibly separating work areas or providing private office spaces)\n\nSpatial Arrangement Hint: The layout suggests a multi-functional office space with a mix of workstations and lounge seating, promoting both productivity and comfort. The central desks facilitate teamwork, while the side chairs offer a casual discussion area.\n\nObject Interaction Clue: The presence of multiple workstations with chairs arranged around them indicates a space for group collaboration or focused tasks. The lounge area provides an alternative workspace or a resting spot, emphasizing flexibility in the office environment.",
    "scene0059": "Scene Type: Dining or Meeting Area\n\nKey Objects:\n\n- Central Dining/Meeting Table (Middle of the room, main focal point for discussions or meals)\n- Chairs Around the Table (Providing seating for group gatherings or dining)\n- Couch/Sofa (Against the top wall, possibly for relaxed seating or informal meetings)\n- Storage Shelves or Cabinets (Lining the sides, likely used for storing utensils, documents, or other essentials)\n- Side Tables or Additional Seating (Placed around the room for flexibility in seating arrangements)\n\nSpatial Arrangement Hint: The central table and surrounding chairs suggest a communal space used for either dining or formal meetings. The presence of a couch and storage shelves hints at a multifunctional environment where work, leisure, or meals can take place.\n\nObject Interaction Clue: The central placement of the table encourages group activities, whether it's a team meeting, family meal, or collaborative work session. The surrounding shelves indicate accessibility to stored items, possibly enhancing efficiency in the room’s intended use.",
    "scene0060": "Scene Type: Hallway with Workstations or Storage\n\nKey Objects:\n\n- Desks or Workstations (Located along both sides, possibly for office or study use)\n- Storage Shelves or Cabinets (Against the walls, used for organizing supplies or documents)\n- Toilets (Bottom-left, indicating the presence of restroom facilities in the space)\n- Scattered Chairs (Positioned near desks, suggesting an interactive or working environment)\n- Various Items on Surfaces (Documents, tools, or electronics, reinforcing an active workspace)\n\nSpatial Arrangement Hint: This long, narrow space suggests a hallway or a small office corridor with designated workstations. The presence of desks and chairs implies that this area is actively used for work, while the restroom facilities further indicate its function in a workplace or shared environment.\n\nObject Interaction Clue: The presence of workstations and chairs along both sides suggests an environment where individuals might conduct work independently while still being within proximity for collaboration. The storage shelves provide easy access to essential materials or documents.",
    "scene0061": "Scene Type: Living Room or Lounge Area\n\nKey Objects:\n\n- L-Shaped Sofa (Bottom-left, primary seating area for relaxation or conversation)\n- Round Dining Table with Chairs (Top-center, designated for meals or discussions)\n- Wall-mounted Television (Right side, entertainment focal point of the room)\n- Side Tables (Near sofas and armchairs, likely used for drinks, books, or decorations)\n- Decorative Elements (Carpet, lighting, and possibly artwork, enhancing the ambiance of the room)\n\nSpatial Arrangement Hint: The layout suggests a multi-functional space where people can relax, socialize, and dine. The L-shaped sofa encourages a cozy atmosphere, while the dining table provides a separate but connected area for meals. The television acts as a focal point, directing attention towards entertainment.\n\nObject Interaction Clue: The seating arrangement supports both group conversations and individual relaxation. The round dining table encourages face-to-face interaction, making it suitable for both casual dining and meetings. The presence of side tables suggests convenience, allowing easy access to items while seated.",
    "scene0062": "Scene Type: Bathroom\n\nKey Objects:\n\n- Toilet (Bottom-left, essential fixture for hygiene and sanitation)\n- Sink with Counter (Bottom-right, used for washing hands and personal grooming)\n- Mirror (Top-center, aiding in grooming and daily routines)\n- Wall-mounted Shelves (Right side, likely for storing toiletries and essentials)\n- Lighting Fixtures (Top, providing illumination for the space)\n\nSpatial Arrangement Hint: This compact bathroom layout maximizes space efficiency by placing essential fixtures along the walls. The sink and toilet are positioned for convenience, with shelving providing additional storage without occupying floor space. The mirror and lighting enhance usability, making it practical for daily routines.\n\nObject Interaction Clue: Users can easily access toiletries from the shelves while using the sink. The mirror serves as a focal point for grooming, while the placement of the toilet ensures accessibility. The design prioritizes functionality and accessibility in a confined space.",
    "scene0063": "Scene Type: Hallway or Corridor\n\nKey Objects:\n\n- Curved Wall Sections (Left and right sides, defining the hallway space)\n- Doors or Openings (Various locations, leading to adjacent rooms or spaces)\n- Wall-mounted Fixtures (Left side, potentially lights or small shelves for decoration or function)\n- Counter or Small Table (Bottom-left, possibly for temporary storage or display)\n- Flooring Transition (Different materials, suggesting a shift between areas or room purposes)\n\nSpatial Arrangement Hint: This space appears to be a transitional hallway or corridor connecting different rooms. The curved walls give it a dynamic layout, and the presence of openings suggests accessibility to multiple areas. A mix of fixtures and small furniture indicates that the space is not only a passageway but also has functional or decorative elements.\n\nObject Interaction Clue: People moving through this space likely use it for circulation between rooms. The small table or counter may serve as a drop-off point for keys, mail, or personal items. The different flooring materials hint at movement from one room type to another, such as from a public to a private space.",
    "scene0064": "Scene Type: Library or Study Area\n\nKey Objects:\n\n- Bookshelves (Top section, filled with books, indicating a study or library setting)\n- Reading Tables (Centrally positioned, with books or papers on top, used for study or discussions)\n- Armchairs (Middle section, providing comfortable seating for reading or relaxation)\n- Couch or Bench (Bottom section, additional seating for a relaxed reading space)\n- Wall with Shelving (Right side, possibly additional bookshelves or display storage)\n\nSpatial Arrangement Hint: This space is structured for focused study or reading, with bookshelves along the walls and tables arranged centrally for shared or individual use. The mix of seating options suggests both casual and dedicated study settings, catering to different activities such as research, reading, or quiet discussions.\n\nObject Interaction Clue: Visitors in this space likely browse the bookshelves, sit at the tables for reading or writing, and use the armchairs for a more comfortable study experience. The mix of functional and relaxed seating options indicates a flexible use of space, allowing both focused work and leisurely reading.",
    "scene0065": "Scene Type: Bathroom\n\nKey Objects:\n\n- Toilet (Centered, primary fixture of the bathroom)\n- Sink with Counter (Left side, used for handwashing and grooming)\n- Mirror (Above the sink, reflecting light and providing visibility for users)\n- Partial Shower or Bathtub (Right side, likely partially obstructed by damage or angle)\n- Doorway (Bottom-right, entrance to the bathroom, leading to an adjacent space)\n\nSpatial Arrangement Hint: This is a compact bathroom with a functional layout. The sink and mirror are placed on one side, with the toilet directly across from the entrance. The partial wall on the right suggests a shower or enclosed bathing area. The space appears to be somewhat damaged, affecting the ceiling and part of the wall.\n\nObject Interaction Clue: Users typically enter, use the toilet or sink, and may access the shower if available. The mirror helps with personal grooming, while the counter provides space for toiletries. The small size suggests it could be a secondary or guest bathroom rather than a primary one.",
    "scene0066": "Scene Type: Conference Room / Meeting Space\n\nKey Objects:\n\n- Large Conference Table (Center, primary meeting area)\n- Multiple Office Chairs (Arranged around the table, seating for participants)\n- Ceiling Light Fixture (Above the table, providing illumination for the meeting area)\n- Side Tables or Storage Units (Left and right, possibly used for supplies or refreshments)\n- Open Walkways (Around the table, allowing movement between seats and exits)\n\nSpatial Arrangement Hint: This space is designed for group discussions, presentations, or team collaboration. The central conference table dominates the room, surrounded by chairs arranged for direct engagement. The lighting above enhances visibility, suggesting an environment meant for focus and communication.\n\nObject Interaction Clue: Participants are likely to sit around the table, facing each other for discussions or presentations. The space promotes face-to-face interaction, making it ideal for team meetings, planning sessions, or corporate discussions.",
    "scene0067": "Scene Type: Public Restroom\n\nKey Objects:\n\n- Toilets (Left and back, primary fixtures for restroom use)\n- Sinks (Back wall, used for handwashing and hygiene)\n- Paper Towel or Hand Dryer (Near the sink, for drying hands after washing)\n- Toilet Paper Dispensers (Near the toilets, providing necessary supplies)\n- Handrails or Support Bars (Along the walls, indicating accessibility features for users with mobility needs)\n\nSpatial Arrangement Hint: The layout suggests a functional and accessible public restroom, possibly in a commercial or office setting. The separation of the sink and toilet areas ensures efficient use, while the presence of handrails indicates compliance with accessibility standards.\n\nObject Interaction Clue: Users will interact with the sink for washing hands, the toilets for restroom use, and the paper towel or hand dryer for drying. The handrails suggest that this space is designed for ease of movement, particularly for those with mobility challenges.",
    "scene0068": "Scene Type: Small Kitchen or Pantry\n\nKey Objects:\n\n- Sink (Top-center, used for washing dishes and food preparation)\n- Countertop (Adjacent to sink, workspace for food preparation and storage)\n- Cabinets and Shelving (Top and side walls, used for storing kitchen supplies, utensils, or pantry items)\n- Appliances (Lower section, possibly a refrigerator or microwave for meal preparation)\n- Trash Bin (Lower-left corner, used for disposing of waste and maintaining cleanliness)\n\nSpatial Arrangement Hint: The layout is compact and efficient, typical of a small kitchen or office pantry. The sink and countertop form the primary workspace, while cabinets provide necessary storage for utensils and ingredients. The trash bin ensures cleanliness in the space.\n\nObject Interaction Clue: Users will interact with the sink for washing, the countertop for food prep, the appliances for cooking or reheating, and the cabinets for storing supplies. The placement of these elements suggests a workspace designed for quick and functional use.",
    "scene0069": "Scene Type: Staircase or Hallway\n\nKey Objects:\n\n- Main Staircase (Right-side, primary vertical connection between floors)\n- Secondary Staircase or Reflection (Left-side, possibly a mirror reflecting stairs or an additional staircase)\n- Handrails (Both sides of the staircase, for support and safety while ascending or descending)\n- Carpeted Steps (Covering the stairs, adding grip and comfort for users moving between levels)\n- Wooden Flooring (Bottom section, marking the transition between levels or rooms)\n\nSpatial Arrangement Hint: The staircases provide access between floors, with handrails on the sides for stability. The patterned carpet indicates a domestic or formal interior setting. The second set of stairs or reflection adds depth to the space, suggesting a split or multi-level design.\n\nObject Interaction Clue: Users primarily interact with the stairs for movement between floors, using the handrails for stability. The carpet enhances safety by reducing slipperiness, making the staircase more user-friendly.",
    "scene0070": "Scene Type: Kitchen or Small Dining Area\n\nKey Objects:\n\n- Stove and Counter (Right-side, used for food preparation and cooking)\n- Refrigerator (Top-center, primary storage for perishable food items)\n- Round Table (Center, likely for dining or casual food preparation)\n- Cabinets and Shelving (Left-side, storage for kitchenware and food items)\n- Carpet or Rug (Bottom-center, possibly for comfort and style in the kitchen area)\n\nSpatial Arrangement Hint: This space is compact, indicating it might be part of a small apartment or a secondary kitchenette. The round table allows for informal dining, while the proximity of the stove and refrigerator supports an efficient cooking workflow.\n\nObject Interaction Clue: Users interact with the stove for cooking, the refrigerator for food storage, and the cabinets for utensils and pantry items. The table suggests social interaction or meal consumption in the same space.",
    "scene0071": "Scene Type: Interior Space (Possibly a Room)\n\nKey Objects:\n\n- Ceiling (Top, partially distorted)\n- Walls (Surrounding structure, some missing sections)\n- Floor (Bottom, with torn or irregular surfaces)\n- Doorway or Window Frame (Right side, open space)\n- Hanging Object (Near the ceiling, possibly a fixture or decoration)\n\nSpatial Arrangement Hint: The open frame on the right suggests an entry or exit point, influencing navigation within the space.\n\nObject Interaction Clue: The hanging object near the ceiling may be a fixture (e.g., a light or a hook), affecting how other objects are positioned around it.",
    "scene0072": "Scene Type: Bedroom\n\nKey Objects:\n\n- Bed (Left side, positioned against the wall)\n- Green Rug (Center of the room, partially covering the floor)\n- Cabinet or Dresser (Bottom right, near the open area)\n- Door (Top center, leading to another space)\n- Small Table or Nightstand (Near the bed, holding objects)\n\nSpatial Arrangement Hint: The bed is positioned against the left wall, maximizing space in the narrow room layout.\n\nObject Interaction Clue: The green rug in the center serves as a pathway, influencing movement between the bed, dresser, and door.",
    "scene0073": "Scene Type: Bedroom\n\nKey Objects:\n\n- Bed (Right side, positioned against the wall)\n- Desk with Chair (Top left corner, near the curtain)\n- Curtain (Top, covering a potential window or closet)\n- Dumbbells (Bottom center, on the floor)\n- Storage Unit or Shelf (Bottom right, holding various objects)\n\nSpatial Arrangement Hint: The bed is placed against the right wall, leaving an open walking space in the center that connects the desk, storage unit, and door.\n\nObject Interaction Clue: The curtain at the top may be covering a window or closet, affecting lighting and accessibility in the room.",
    "scene0074": "Scene Type: Cluttered Room\n\nKey Objects:\n\n- Bed or Couch (Left side, partially covered by objects)\n- Shelving Unit (Right side, filled with various items)\n- Table or Desk (Bottom center, supporting objects)\n- Wall Clock (Top left, mounted on the wall)\n- Loose Items (Scattered throughout, including clothes and miscellaneous objects)\n\nSpatial Arrangement Hint: The shelving unit on the right serves as a primary storage space, while the central area remains obstructed due to clutter, limiting movement.\n\nObject Interaction Clue: The bed or couch is partially covered with objects, suggesting it may function as both a seating and storage area."
}